; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v12 ?v1)
             (pred_12 ?v11 ?v6)
             (pred_2 ?v12 ?v6)
             (pred_6 ?v3 ?v12 )
	     (pred_5 ?v12)
             (pred_4 ?v7)
             (pred_7 ?v11)
             (pred_11 ?v6)
             (pred_3 ?v12)
             (pred_8 ?v11)
             (pred_9 ?v12)
             (pred_10 ))



(:action op_5
:parameters (?v10 ?v2 ?v5 ?v4)
:precondition (and (pred_4 ?v10) (pred_4 ?v2) (pred_7 ?v5) (pred_11 ?v4)
          (pred_1 ?v10 ?v2) (pred_12 ?v5 ?v4)
                   (pred_2 ?v2 ?v4) (pred_5 ?v10) 
                   (pred_3 ?v2) (pred_8 ?v5))
:effect (and  (pred_9 ?v2) (not (pred_3 ?v2))))


(:action op_2
:parameters (?v10 ?v9)
:precondition (and (pred_4 ?v10) (pred_4 ?v9)
               (pred_5 ?v10) (pred_1 ?v10 ?v9) (pred_9 ?v9))
:effect (and (pred_5 ?v9) (not (pred_5 ?v10))))

(:action op_3
:parameters (?v10 ?v5)
:precondition (and (pred_4 ?v10) (pred_7 ?v5) 
                  (pred_5 ?v10) (pred_6 ?v5 ?v10) (pred_10 ))
:effect (and (pred_8 ?v5)
   (not (pred_6 ?v5 ?v10)) (not (pred_10 ))))


(:action op_1
:parameters (?v10 ?v8 ?v13)
:precondition (and (pred_4 ?v10) (pred_7 ?v8) (pred_7 ?v13)
                  (pred_5 ?v10) (pred_8 ?v13) (pred_6 ?v8 ?v10))
:effect (and (pred_8 ?v8) (pred_6 ?v13 ?v10)
        (not (pred_8 ?v13)) (not (pred_6 ?v8 ?v10))))

(:action op_4
:parameters (?v10 ?v5)
:precondition (and (pred_4 ?v10) (pred_7 ?v5) 
                  (pred_5 ?v10) (pred_8 ?v5))
:effect (and (pred_10 ) (pred_6 ?v5 ?v10) (not (pred_8 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_20 obj_14 obj_06 obj_09 obj_11 obj_17 obj_19 obj_10 obj_01 obj_15 obj_02 obj_18 obj_08 obj_13 obj_04 obj_12
    obj_07 obj_16
    obj_03 obj_05
    )

    (:init
       (pred_10)

       (pred_4 obj_20)
       (pred_4 obj_14)
       (pred_4 obj_06)
       (pred_4 obj_09)
       (pred_4 obj_11)
       (pred_4 obj_17)
       (pred_4 obj_19)
       (pred_4 obj_10)
       (pred_4 obj_01)
       (pred_4 obj_15)
       (pred_4 obj_02)
       (pred_4 obj_18)
       (pred_4 obj_08)
       (pred_4 obj_13)
       (pred_4 obj_04)
       (pred_4 obj_12)
       (pred_11 obj_07)
       (pred_11 obj_16)
       (pred_7 obj_03)
       (pred_7 obj_05)

       (pred_1 obj_20 obj_11)
       (pred_1 obj_20 obj_14)
       (pred_1 obj_14 obj_17)
       (pred_1 obj_14 obj_06)
       (pred_1 obj_14 obj_20)
       (pred_1 obj_06 obj_19)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_06 obj_14)
       (pred_1 obj_09 obj_10)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_11 obj_01)
       (pred_1 obj_11 obj_17)
       (pred_1 obj_11 obj_20)
       (pred_1 obj_17 obj_15)
       (pred_1 obj_17 obj_19)
       (pred_1 obj_17 obj_14)
       (pred_1 obj_17 obj_11)
       (pred_1 obj_19 obj_02)
       (pred_1 obj_19 obj_10)
       (pred_1 obj_19 obj_06)
       (pred_1 obj_19 obj_17)
       (pred_1 obj_10 obj_18)
       (pred_1 obj_10 obj_09)
       (pred_1 obj_10 obj_19)
       (pred_1 obj_01 obj_08)
       (pred_1 obj_01 obj_15)
       (pred_1 obj_01 obj_11)
       (pred_1 obj_15 obj_13)
       (pred_1 obj_15 obj_02)
       (pred_1 obj_15 obj_17)
       (pred_1 obj_15 obj_01)
       (pred_1 obj_02 obj_04)
       (pred_1 obj_02 obj_18)
       (pred_1 obj_02 obj_19)
       (pred_1 obj_02 obj_15)
       (pred_1 obj_18 obj_12)
       (pred_1 obj_18 obj_10)
       (pred_1 obj_18 obj_02)
       (pred_1 obj_08 obj_13)
       (pred_1 obj_08 obj_01)
       (pred_1 obj_13 obj_04)
       (pred_1 obj_13 obj_15)
       (pred_1 obj_13 obj_08)
       (pred_1 obj_04 obj_12)
       (pred_1 obj_04 obj_02)
       (pred_1 obj_04 obj_13)
       (pred_1 obj_12 obj_18)
       (pred_1 obj_12 obj_04)
       (pred_3 obj_20)
       (pred_3 obj_02)
       (pred_2  obj_20 obj_07)
       (pred_2  obj_02 obj_16)
       (pred_9 obj_14)
       (pred_9 obj_06)
       (pred_9 obj_09)
       (pred_9 obj_11)
       (pred_9 obj_17)
       (pred_9 obj_19)
       (pred_9 obj_10)
       (pred_9 obj_01)
       (pred_9 obj_15)
       (pred_9 obj_18)
       (pred_9 obj_08)
       (pred_9 obj_13)
       (pred_9 obj_04)
       (pred_9 obj_12)

       (pred_12  obj_03 obj_07)
       (pred_12  obj_05 obj_16)
       (pred_6 obj_03 obj_12)
       (pred_6 obj_05 obj_01)
       (pred_5 obj_13)
    )

    (:goal (and
       (pred_6 obj_03 obj_13)
    ))
(:constraints
  (always (not (pred_5 obj_04)))
)
)

; plan
1. (op_2 obj_13 obj_15)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_15)
   goals met: 0 of 1
2. (op_2 obj_15 obj_01)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_01)
   goals met: 0 of 1
3. (op_3 obj_01 obj_05)
   deleted: (pred_6 obj_05 obj_01) (pred_10)
   added: (pred_8 obj_05)
   goals met: 0 of 1
4. (op_2 obj_01 obj_15)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_15)
   goals met: 0 of 1
5. (op_5 obj_15 obj_02 obj_05 obj_16)
   deleted: (pred_3 obj_02)
   added: (pred_9 obj_02)
   goals met: 0 of 1
6. (op_2 obj_15 obj_13)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_13)
   goals met: 0 of 1
7. (op_4 obj_13 obj_05)
   deleted: (pred_8 obj_05)
   added: (pred_10) (pred_6 obj_05 obj_13)
   goals met: 0 of 1
8. (op_2 obj_13 obj_15)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_15)
   goals met: 0 of 1
9. (op_2 obj_15 obj_02)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_02)
   goals met: 0 of 1
10. (op_2 obj_02 obj_18)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_18)
   goals met: 0 of 1
11. (op_2 obj_18 obj_12)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_12)
   goals met: 0 of 1
12. (op_3 obj_12 obj_03)
   deleted: (pred_6 obj_03 obj_12) (pred_10)
   added: (pred_8 obj_03)
   goals met: 0 of 1
13. (op_2 obj_12 obj_18)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_18)
   goals met: 0 of 1
14. (op_2 obj_18 obj_02)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_02)
   goals met: 0 of 1
15. (op_2 obj_02 obj_15)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_15)
   goals met: 0 of 1
16. (op_2 obj_15 obj_13)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_13)
   goals met: 0 of 1
17. (op_1 obj_13 obj_05 obj_03)
   deleted: (pred_8 obj_03) (pred_6 obj_05 obj_13)
   added: (pred_8 obj_05) (pred_6 obj_03 obj_13)
   goals met: 1 of 1
